/* No comment provided by engineer. */
"+48 61 630 60 05" = "+48 61 630 60 05";

/* No comment provided by engineer. */
"Attackers might be trying to steal your information (for example, passwords, messages, or credit cards)." = "Atacatorii pot încerca să vă fure informaţiile (de ex., parole, mesaje sau carduri de credit).";

/* No comment provided by engineer. */
"Back" = "Înapoi";

/* No comment provided by engineer. */
"Bank transfer" = "Transfer bancar";

/* No comment provided by engineer. */
"Cancel" = "Anulare";

/* No comment provided by engineer. */
"Card" = "Card";

/* No comment provided by engineer. */
"Card number" = "Număr card";

/* No comment provided by engineer. */
"Close and go back" = "Închidere şi revenire";

/* No comment provided by engineer. */
"Correct your card number" = "Corectaţi numărul cardului";

/* No comment provided by engineer. */
"Credit card" = "Card de credit";

/* No comment provided by engineer. */
"credit or debit" = "credit sau debit";

/* No comment provided by engineer. */
"Customer service" = "Serviciul Clienţi";

/* No comment provided by engineer. */
"CVV code" = "Cod CVV";

/* No comment provided by engineer. */
"Delete" = "Ştergere";

/* No comment provided by engineer. */
"Enter a card number" = "Introduceţi numărul cardului";

/* No comment provided by engineer. */
"Please enter a valid date" = "Vă rugăm să introduceţi o dată validă";
"Please enter a valid code" = "Vă rugăm să introduceţi un cod valid";
"MM/YY" = "LL/AA";

/* No comment provided by engineer. */
"Enter CVV code" = "Introduceţi codul CVV";

/* No comment provided by engineer. */
"Error" = "Eroare";

/* No comment provided by engineer. */
"Expiration date" = "Data expirării";

/* No comment provided by engineer. */
"fast online transfer" = "transfer online rapid";

/* No comment provided by engineer. */
"footer.termsAndCondiontsUrl" = "https://static.payu.com/sites/terms/files/TERMS_AND_CONDITIONS_OF_PROVIDING_PAYU_SERVICE.pdf";

/* No comment provided by engineer. */
"I accept " = "Sunt de acord ";

/* No comment provided by engineer. */
"New card" = "Card nou";

/* No comment provided by engineer. */
"No, stay on one payment page" = "Nu, rămân pe pagina de plată";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Publisher" = "Editor";

/* No comment provided by engineer. */
"Save and use" = "Salvare şi folosire";

/* No comment provided by engineer. */
"Scan Card" = "Scanare card";

/* No comment provided by engineer. */
"Position your card in this frame" = "Poziţionaţi cardul în acest cadru";

/* No comment provided by engineer. */
"Hold still…" = "Ţineţi-l nemişcat…";

/* No comment provided by engineer. */
"Select payment method" = "Selectaţi metoda de plată";

/* No comment provided by engineer. */
"This card is not supported" = "Acest card nu este acceptat";

/* No comment provided by engineer. */
"PayU Payment Terms" = "Termeni privind plata PayU";

/* No comment provided by engineer. */
"Use" = "Utilizare";

/* No comment provided by engineer. */
"Version" = "Versiunea";

/* No comment provided by engineer. */
"Yes, go back" = "Da, revin";

/* No comment provided by engineer. */
"Your connection is not secure" = "Conexiunea dvs. nu este securizată";

/* No comment provided by engineer. */
"Your payment will be canceled. Continue?" = "Plata dvs. va fi anulată. Continuaţi?";

/* Apple Pay strings */
"Apple Pay" = "Apple Pay";
"Configure to pay by phone" = "Configurare pentru plata prin telefon";
"Pay by phone" = "Plată prin telefon";

/* Blik strings */
"BLIK" = "BLIK";
"use code from your bank app" = "utilizaţi codul din aplicaţia dvs. bancară";
"Enter BLIK code" = "Introduceţi codul BLIK";
"Authorize and store BLIK payment in your bank app" = "Autorizaţi şi stocaţi plata BLIK în aplicaţia dvs. bancară";
"one-tap payment" = "plată cu o atingere";
"Enter new BLIK code" = "Introduceţi noul cod BLIK";
"saved BLIK payment" = "plată BLIK salvată";

/* Mastercard Installments strings */
"Transaction approved" = "Tranzacţie aprobată";
"Installment payment" = "Plată rată";
"The recipient will get the total order amount." = "Destinatarul va primi suma totală din comandă.";
"You can split this payment into installments with Mastercard." = "Puteţi scinda această plată în rate cu Mastercard.";
"Split into installments" = "Scindare în rate";
"No, thanks" = "Nu, mulţumesc";
"You can pay in installments with Mastercard. Select the number of installments to confirm." = "Puteţi plăti în rate cu Mastercard. Selectaţi numărul de rate pentru confirmare.";
"total" = "total";
"1st installment" = "Prima rată";

/* payu installments */
"Installments" = "Rate";
"decision in even 15 minutes" = "decizie chiar în 15 minute";
"Your application is still being reviewed." = "Cererea dvs. este încă analizată.";
"Your lender and/or store will inform you of the next steps." = "Cel care vă împrumută şi/sau magazinul vă vor informa cu privire la paşii următori.";
"In order to finalize the process You will be redirected to browser" = "Pentru a finaliza procesul, veţi fi redirecţionat către browser";
"Accept" = "Accept";
